step03/run/simpleCar/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;
    libs            (forces);
    writeControl    writeTime;
    writeFields     true;

    patches         (body);
    p               p;
    U               U;
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1;           // Required when rho = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (3.5 0 0);  // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         10;
    lRef            4;          // Wheelbase length
    Aref            1;          // Estimated
    porosity        on;

    binData
    {
        nBin            20;          // output data into 20 bins
        direction       (1 0 0);     // bin direction
        cumulative      yes;
    }
}


// ************************************************************************* //
